### Tutorial reference 
https://youtu.be/tRKeLrwfUgU?si=5VMUyl1QB9XU1kcn

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('teclo_churn.csv')

## read starting,ending rows, 
df.head()
df.tail()

In [ ]:
df.columns

In [ ]:
df.dtypes

In [ ]:
df.describe()
## GET details like
# count, mean, std, min, max etc.

In [ ]:
df.head()

In [ ]:
df['State']
# df['column_name']

In [ ]:
df.State.unique()

In [ ]:
df[['State','Voice mail plan','Customer service calls']]

In [ ]:
df[(df['Voice mail plan'] == 'No')]

In [ ]:
## Data Fillter 
df[(df['International plan'] == 'No') & (df['State'] == 'TN') & (df['Churn'] == True) ]

### Indexing with iloc

In [168]:
df.iloc[0:5]

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
0,KS,128,415,No,Yes,25,265.1,110.0,45.07,197.4,99.0,16.78,244.7,91.0,11.01,10.0,3,2.70,1.0,False
1,OH,107,415,No,Yes,26,161.6,123.0,27.47,195.5,103.0,16.62,254.4,103.0,11.45,13.7,3,3.70,1.0,False
2,NJ,137,415,No,No,0,243.4,114.0,41.38,121.2,110.0,10.30,162.6,104.0,7.32,12.2,5,3.29,0.0,False
3,OH,84,408,Yes,No,0,299.4,71.0,50.90,61.9,88.0,5.26,196.9,89.0,8.86,6.6,7,1.78,2.0,False
4,OK,75,415,Yes,No,0,166.7,113.0,28.34,148.3,122.0,12.61,186.9,121.0,8.41,10.1,3,2.73,3.0,False

In [169]:
df.iloc[0:5, 0:4]

  State  Account length  Area code International plan
0    KS             128        415                 No
1    OH             107        415                 No
2    NJ             137        415                 No
3    OH              84        408                Yes
4    OK              75        415                Yes

### Updating data

In [170]:
df.isnull().sum()
## column_name      null_count

State                      0
Account length             0
Area code                  0
International plan         0
Voice mail plan            0
Number vmail messages      0
Total day minutes         10
Total day calls           10
Total day charge          18
Total eve minutes          9
Total eve calls            8
Total eve charge           0
Total night minutes        0
Total night calls          1
Total night charge         0
Total intl minutes         0
Total intl calls           0
Total intl charge          5
Customer service calls     5
Churn                      8
dtype: int64

### Drop columns from the DataFrame

In [ ]:
df.drop('Area code', axis=1)
df = df.drop(columns=['Area code'])

## drop all columns in a DataFrame except for some specified columns
df = df[['State','Total night minutes','Total intl minutes' ,'Churn']]

In [194]:
df['NewCol'] = df['Total night minutes'] + df['Total intl minutes']

In [195]:
df[['State', 'NewCol', 'Total night minutes', 'Total intl minutes']]

     State  NewCol  Total night minutes  Total intl minutes
0       KS   254.7                244.7                10.0
1       OH   268.1                254.4                13.7
2       NJ   174.8                162.6                12.2
3       OH   203.5                196.9                 6.6
4       OK   197.0                186.9                10.1
...    ...     ...                  ...                 ...
3328    AZ   289.0                279.1                 9.9
3329    WV   200.9                191.3                 9.6
3330    RI   206.0                191.9                14.1
3331    CT   144.2                139.2                 5.0
3332    TN   255.1                241.4                13.7

[3333 rows x 4 columns]

### Insert new column with logic

In [196]:
df['NewCol_calc'] = df['Churn'].apply(lambda x: 1 if x==True else 0)

In [197]:
df[['State', 'NewCol', 'NewCol_calc']]
df[df['NewCol_calc'] == True].head()

   State  Total night minutes  Total intl minutes Churn  NewCol  NewCol_calc
10    IN                208.8                12.7  True   221.5            1
15    NY                160.6                 5.4  True   166.0            1
21    CO                209.6                 5.7  True   215.3            1
33    AZ                280.2                11.8  True   292.0            1
41    MD                122.2                14.6  True   136.8            1

### Output Create new CSV

In [198]:
df.to_csv('output.csv')